In [1]:
!pip install pandas 
!pip install numpy
!pip install seaborn

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Requirement already satisfied: numpy in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (1.26.4)
Requirement already satisfied: seaborn in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (0.13.2)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from seaborn) (1.26.4)
Requirement already satisfied: pandas>=1.2 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from seaborn) (2.2.2)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from seaborn) (3.9.0)
Requirement already satisfied: contourpy>=1.0.1 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.2.1)
Requirement already satisfied: cycler>=0.10 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.51.0)
Requirement already satisfied: kiwisolver>=1.3.1 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.5)
Requirement already satisfied: packaging>=20.0 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (24.0)
Requirement already satisfied: pillow>=8 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (10.3.0)
Requirement already satisfied: pyparsing>=2.3.1 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.1.2)
Requirement already satisfied: python-dateutil>=2.7 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.16.0)

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
pip install --upgrade certifi

Requirement already satisfied: certifi in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (2024.2.2)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import ssl
import urllib.request

ssl._create_default_https_context = ssl._create_unverified_context

## Titanic Dataset

In [5]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

### Missing Values in the Titanic dataset

In [6]:
missing_values = df.isnull().sum()
print("Missing Values:\n", missing_values)

Missing Values:
 survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

### Dropping Columns

In [7]:
columns_to_drop = ['deck', 'who', 'adult_male']  # List of column names to drop
df.drop(columns_to_drop, axis=1, inplace=True)

### Removing Null Rows

In [8]:
df.dropna(subset=['fare', 'age'], inplace=True)
missing_values = df.isnull().sum()
print("Missing Values:\n", missing_values)

Missing Values:
 survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
embark_town    2
alive          0
alone          0
dtype: int64

### Duplicated Values

In [9]:
duplicate_rows = df[df.duplicated()]
duplicate_rows

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alive,alone
133,1,2,female,29.00,1,0,26.0000,S,Second,Southampton,yes,False
173,0,3,male,21.00,0,0,7.9250,S,Third,Southampton,no,True
213,0,2,male,30.00,0,0,13.0000,S,Second,Southampton,no,True
313,0,3,male,28.00,0,0,7.8958,S,Third,Southampton,no,True
320,0,3,male,22.00,0,0,7.2500,S,Third,Southampton,no,True
343,0,2,male,25.00,0,0,13.0000,S,Second,Southampton,no,True
355,0,3,male,28.00,0,0,9.5000,S,Third,Southampton,no,True
387,1,2,female,36.00,0,0,13.0000,S,Second,Southampton,yes,True
418,0,2,male,30.00,0,0,13.0000,S,Second,Southampton,no,True
476,0,2,male,34.00,1,0,21.0000,S,Second,Southampton,no,False
488,0,3,male,30.00,0,0,8.0500,S,Third,Southampton,no,True
494,0,3,male,21.00,0,0,8.0500,S,Third,Southampton,no,True
500,0,3,male,17.00,0,0,8.6625,S,Third,Southampton,no,True
521,0,3,male,22.00,0,0,7.8958,S,Third,Southampton,no,True
526,1,2,female,50.00,0,0,10.5000,S,Second,Southampton,yes,True
555,0,1,male,62.00,0,0,26.5500,S,First,Southampton,no,True
588,0,3,male,22.00,0,0,8.0500,S,Third,Southampton,no,True
614,0,3,male,35.00,0,0,8.0500,S,Third,Southampton,no,True
635,1,2,female,28.00,0,0,13.0000,S,Second,Southampton,yes,True
636,0,3,male,32.00,0,0,7.9250,S,Third,Southampton,no,True
640,0,3,male,20.00,0,0,7.8542,S,Third,Southampton,no,True
641,1,1,female,24.00,0,0,69.3000,C,First,Cherbourg,yes,True
644,1,3,female,0.75,2,1,19.2583,C,Third,Cherbourg,yes,False
646,0,3,male,19.00,0,0,7.8958,S,Third,Southampton,no,True
666,0,2,male,25.00,0,0,13.0000,S,Second,Southampton,no,True
696,0,3,male,44.00,0,0,8.0500,S,Third,Southampton,no,True
733,0,2,male,23.00,0,0,13.0000,S,Second,Southampton,no,True
734,0,2,male,23.00,0,0,13.0000,S,Second,Southampton,no,True
757,0,2,male,18.00,0,0,11.5000,S,Second,Southampton,no,True
758,0,3,male,34.00,0,0,8.0500,S,Third,Southampton,no,True
800,0,2,male,34.00,0,0,13.0000,S,Second,Southampton,no,True
808,0,2,male,39.00,0,0,13.0000,S,Second,Southampton,no,True
838,1,3,male,32.00,0,0,56.4958,S,Third,Southampton,yes,True
844,0,3,male,17.00,0,0,8.6625,S,Third,Southampton,no,True
870,0,3,male,26.00,0,0,7.8958,S,Third,Southampton,no,True
877,0,3,male,19.00,0,0,7.8958,S,Third,Southampton,no,True
884,0,3,male,25.00,0,0,7.0500,S,Third,Southampton,no,True
886,0,2,male,27.00,0,0,13.0000,S,Second,Southampton,no,True

### Dropping Duplicate Values

In [10]:
df.drop_duplicates(inplace=True)
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,Queenstown,no,True

### Renaming Columns

In [11]:
df.rename(columns={'sibsp': 'Siblings/Spouses Onboard', 'parch': 'Parents/Children Onboard'}, inplace=True)
df

,survived,pclass,sex,age,Siblings/Spouses Onboard,Parents/Children Onboard,fare,embarked,class,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,Queenstown,no,True

### Formatting Fare

In [12]:
df['fare'] = df['fare'].round(2)
df

,survived,pclass,sex,age,Siblings/Spouses Onboard,Parents/Children Onboard,fare,embarked,class,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.25,S,Third,Southampton,no,False
1,1,1,female,38.0,1,0,71.28,C,First,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.92,S,Third,Southampton,yes,True
3,1,1,female,35.0,1,0,53.10,S,First,Southampton,yes,False
4,0,3,male,35.0,0,0,8.05,S,Third,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.50,S,Second,Southampton,no,True
885,0,3,female,39.0,0,5,29.12,Q,Third,Queenstown,no,False
887,1,1,female,19.0,0,0,30.00,S,First,Southampton,yes,True
889,1,1,male,26.0,0,0,30.00,C,First,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,Queenstown,no,True

### Descriptive Stats

In [13]:
stats = df.describe()
stats_rounded = stats.round(2)
stats_rounded

,survived,pclass,age,Siblings/Spouses Onboard,Parents/Children Onboard,fare
count,676.00,676.00,676.00,676.00,676.00,676.00
mean,0.42,2.22,29.81,0.54,0.45,35.85
std,0.49,0.85,14.73,0.95,0.87,54.07
min,0.00,1.00,0.42,0.00,0.00,0.00
25%,0.00,1.00,20.00,0.00,0.00,8.05
50%,0.00,2.00,28.00,0.00,0.00,16.10
75%,1.00,3.00,39.00,1.00,1.00,35.50
max,1.00,3.00,80.00,5.00,6.00,512.33

### Average Fare and Age per Class

In [16]:
average_stats = df.groupby('class', observed=False)[['fare', 'age']].mean()
average_stats

             fare        age
class
First   88.396793  38.181630
Second  22.168228  29.859684
Third   13.377665  25.180150

### New Column added to the DataFrame

In [17]:
df['fare_percentage'] = (df['fare'] / df['fare'].sum()) * 100
df

,survived,pclass,sex,age,Siblings/Spouses Onboard,Parents/Children Onboard,fare,embarked,class,embark_town,alive,alone,fare_percentage
0,0,3,male,22.0,1,0,7.25,S,Third,Southampton,no,False,0.029915
1,1,1,female,38.0,1,0,71.28,C,First,Cherbourg,yes,False,0.294111
2,1,3,female,26.0,0,0,7.92,S,Third,Southampton,yes,True,0.032679
3,1,1,female,35.0,1,0,53.10,S,First,Southampton,yes,False,0.219098
4,0,3,male,35.0,0,0,8.05,S,Third,Southampton,no,True,0.033215
...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.50,S,Second,Southampton,no,True,0.043324
885,0,3,female,39.0,0,5,29.12,Q,Third,Queenstown,no,False,0.120153
887,1,1,female,19.0,0,0,30.00,S,First,Southampton,yes,True,0.123784
889,1,1,male,26.0,0,0,30.00,C,First,Cherbourg,yes,True,0.123784
890,0,3,male,32.0,0,0,7.75,Q,Third,Queenstown,no,True,0.031978

### Survivors by Gender

In [18]:
survivors_gender = df.groupby('sex')['survived'].sum()
survivors_gender

sex
female    191
male       92
Name: survived, dtype: int64